## Create dataframe

In [1]:
from pandas import DataFrame

Cars = {'Brand': ['Honda Civic','Toyota Corolla','Ford Focus','Audi A4'],
        'Price': [22000,25000,27000,35000]
        }

df = DataFrame(Cars, columns= ['Brand', 'Price'])
df

            Brand  Price
0     Honda Civic  22000
1  Toyota Corolla  25000
2      Ford Focus  27000
3         Audi A4  35000

## Create sqllite server

In [2]:
import sqlite3
conn = sqlite3.connect('TestDB1.db')
c = conn.cursor()

## Create cars table in server

In [3]:
c.execute('CREATE TABLE CARS (Brand text, Price number)')
conn.commit()

### Add dataframe to cars table

In [4]:
df.to_sql('CARS', conn, if_exists='replace', index = False)

In [12]:
c.execute('''  
SELECT * FROM CARS
          ''')
for row in c.fetchall():
    print (row)

('Honda Civic', 22000)
('Toyota Corolla', 25000)
('Ford Focus', 27000)
('Audi A4', 35000)